In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
WARNING: There was an error checking the latest version of pip.

In [2]:
%load_ext sql

In [3]:
!env | grep POST

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [4]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [5]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [6]:
# task 1

In [7]:
%%sql $CONNECT_DATA
    SELECT distinct fare_conditions 
    FROM ticket_flights 
    WHERE flight_id in(
        SELECT flight_id 
        FROM flights 
        WHERE departure_airport ='AER'AND arrival_airport = 'SVO')

3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

In [ ]:
# task 2

In [24]:
%%sql $CONNECT_DATA
    SELECT distinct model 
    FROM aircrafts 
    WHERE aircraft_code in(
        SELECT aircraft_code 
        FROM flights 
        WHERE departure_airport in(
            SELECT airport_code
            FROM airports
            WHERE city in('Yakutsk')))

3 rows affected.

[('Airbus A319-100',), ('Bombardier CRJ-200',), ('Sukhoi Superjet-100',)]

In [21]:
%%sql $CONNECT_DATA
    SELECT distinct model 
    FROM aircrafts 
    WHERE aircraft_code in(
        SELECT aircraft_code 
        FROM flights 
        WHERE departure_airport in(
            SELECT airport_code
            FROM airports
            WHERE city in('Abakan')))

3 rows affected.

[('Airbus A319-100',), ('Boeing 737-300',), ('Cessna 208 Caravan',)]

In [ ]:
# task 3

In [12]:
%%sql $CONNECT_DATA
    SELECT distinct model 
    FROM aircrafts 
    WHERE aircraft_code in(
        SELECT aircraft_code 
        FROM flights 
        WHERE departure_airport in(
            SELECT airport_code
            FROM airports
            WHERE city in('Yakutsk','Abakan')))

5 rows affected.

[('Airbus A319-100',),
 ('Boeing 737-300',),
 ('Bombardier CRJ-200',),
 ('Cessna 208 Caravan',),
 ('Sukhoi Superjet-100',)]

In [ ]:
# task 4

In [19]:
%%sql $CONNECT_DATA
    SELECT distinct model
    FROM aircrafts
    WHERE model not in(
        SELECT distinct model 
        FROM aircrafts 
        WHERE aircraft_code in(
            SELECT aircraft_code 
            FROM flights 
            WHERE departure_airport in(
                SELECT airport_code
                FROM airports
                WHERE city in('Yakutsk'))))

6 rows affected.

[('Airbus A320-200',),
 ('Airbus A321-200',),
 ('Boeing 737-300',),
 ('Boeing 767-300',),
 ('Boeing 777-300',),
 ('Cessna 208 Caravan',)]

In [25]:
# task 5

In [26]:
%%sql $CONNECT_DATA
    SELECT departure_airport, arrival_airport 
    FROM flights
    WHERE flight_id in(
        SELECT flight_id 
        FROM ticket_flights 
        WHERE ticket_no in(
            SELECT ticket_no 
            FROM tickets 
            WHERE passenger_name = 'ELLA DMITRIEVA'))

7 rows affected.

[('SVO', 'SVX'),
 ('MQF', 'SVX'),
 ('SVX', 'MQF'),
 ('SVX', 'SVO'),
 ('DME', 'HMA'),
 ('DME', 'UUS'),
 ('HMA', 'DME')]